Reports/ПриоритетныеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ПриоритетныеЗадачи</Name>
		</Properties>
	</Report>
</MetaDataObject>

Catalogs/Приоритеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Приоритеты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БольшаяКартинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоЗадач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗадачУКонструктора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МалаяКартинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ПриоритетныеЗадачи/Forms/ФормаОтчета/Ext/Form/Module.bsl
Процедура ПолучитьДанныеЛегенды()
   
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Приоритеты.ЦветФона КАК ЦветФона,
		|	Приоритеты.ЦветТекста КАК ЦветТекста,
		|	Приоритеты.ВсегоЗадач КАК ВсегоЗадач,
		|	Приоритеты.КоличествоЗадачУКонструктора КАК КоличествоЗадачУКонструктора,
		|	Приоритеты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Приоритеты КАК Приоритеты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритеты.НомерПоПорядку";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Легенда = омHTML.ПолучитьЗаголовокHTML();
	
	Легенда = Легенда + омHTML.ПолучитьHeadHTML("Легенда", -1);
	
	Легенда = Легенда + "<table>";
	Легенда = Легенда + "<tr><td>Приоритет</td><td>Всего задач</td><td>У Конструктора</td></tr>";
	
	ШаблонСтроки = "<tr background-color:""%1""  bgcolor=""%2""><td>%3</td><td>%4</td><td>%5</td></tr>";
	
	Пока Выборка.Следующий() Цикл
		ВебЗначениеЦветаФона = омЦвет.ПолучитьВебПредставленияЦвета(Выборка.ЦветФона, Ложь);
		ВебЗначениеТекстФона = омЦвет.ПолучитьВебПредставленияЦвета(Выборка.ЦветТекста);
		Легенда = Легенда + СтрШаблон(ШаблонСтроки, ВебЗначениеЦветаФона, ВебЗначениеЦветаФона, Выборка.Наименование, Выборка.ВсегоЗадач, Выборка.КоличествоЗадачУКонструктора);	
	КонецЦикла;
	
	Легенда = Легенда + "</table>";
	
	Легенда = Легенда + омHTML.ПолучитьХвостHTML();
	
КонецПроцедуры // ПолучитьДанныеЛегенды()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьДанныеЛегенды();
КонецПроцедуры
